In [1]:
import pandas as pd
import numpy as np
import math
import seaborn as sns

from matplotlib import pyplot as plt
%matplotlib inline

In [3]:
suv=pd.read_csv('/Users/niyasop/Desktop/ml-packagess/suv_data.csv')

In [4]:
suv.head(3)

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0

0

In [13]:
suv

     Gender  Age  EstimatedSalary  Purchased
0      Male   19            19000          0
1      Male   35            20000          0
2    Female   26            43000          0
3    Female   27            57000          0
4      Male   19            76000          0
..      ...  ...              ...        ...
395  Female   46            41000          1
396    Male   51            23000          1
397  Female   50            20000          1
398    Male   36            33000          0
399  Female   49            36000          1

[400 rows x 4 columns]

In [16]:
suv.isnull().sum()

Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

In [21]:
geender=pd.get_dummies(suv['Gender'],drop_first=True)
geender

     Male
0       1
1       1
2       0
3       0
4       1
..    ...
395     0
396     1
397     0
398     1
399     0

[400 rows x 1 columns]

In [24]:
suv=pd.concat([suv,geender],axis='columns')

In [26]:
suv.isnull().sum()

Gender             0
Age                0
EstimatedSalary    0
Purchased          0
Male               0
dtype: int64

In [27]:
suv.head(3)

   Gender  Age  EstimatedSalary  Purchased  Male
0    Male   19            19000          0     1
1    Male   35            20000          0     1
2  Female   26            43000          0     0

In [28]:
suv=suv.drop('Gender',axis='columns')

In [29]:
suv

     Age  EstimatedSalary  Purchased  Male
0     19            19000          0     1
1     35            20000          0     1
2     26            43000          0     0
3     27            57000          0     0
4     19            76000          0     1
..   ...              ...        ...   ...
395   46            41000          1     0
396   51            23000          1     1
397   50            20000          1     0
398   36            33000          0     1
399   49            36000          1     0

[400 rows x 4 columns]

In [31]:
y=suv['Purchased']
y

0      0
1      0
2      0
3      0
4      0
      ..
395    1
396    1
397    1
398    0
399    1
Name: Purchased, Length: 400, dtype: int64

In [32]:
X=suv.drop('Purchased',axis='columns')

In [33]:
X

     Age  EstimatedSalary  Male
0     19            19000     1
1     35            20000     1
2     26            43000     0
3     27            57000     0
4     19            76000     1
..   ...              ...   ...
395   46            41000     0
396   51            23000     1
397   50            20000     0
398   36            33000     1
399   49            36000     0

[400 rows x 3 columns]

In [34]:
from sklearn.model_selection import train_test_split

In [35]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=.3,random_state=1)

In [36]:
from sklearn.linear_model import LogisticRegression

In [37]:
logmodel=LogisticRegression()

In [38]:
logmodel.fit(X_train,y_train)

LogisticRegression()

In [39]:
logmodel.fit(X_train,y_train)

LogisticRegression()

In [41]:
from sklearn.metrics import classification_report

In [43]:
predictions =logmodel.predict(X_test)

In [44]:
classification_report(y_test,predictions)

/Users/niyasop/opt/anaconda3/lib/python3.9/site-packages/sklearn/metrics/_classification.py:1248: UndefinedMetricWarning: Precision and F-score are ill-defined and being set to 0.0 in labels with no predicted samples. Use `zero_division` parameter to control this behavior.
  _warn_prf(average, modifier, msg_start, len(result))
/Users/niyasop/opt/anaconda3/lib/python3.9/site-packages/sklearn/metrics/_classification.py:1248: UndefinedMetricWarning: Precision and F-score are ill-defined and being set to 0.0 in labels with no predicted samples. Use `zero_division` parameter to control this behavior.
  _warn_prf(average, modifier, msg_start, len(result))
/Users/niyasop/opt/anaconda3/lib/python3.9/site-packages/sklearn/metrics/_classification.py:1248: UndefinedMetricWarning: Precision and F-score are ill-defined and being set to 0.0 in labels with no predicted samples. Use `zero_division` parameter to control this behavior.
  _warn_prf(average, modifier, msg_start, len(result))

'              precision    recall  f1-score   support\n\n           0       0.60      1.00      0.75        72\n           1       0.00      0.00      0.00        48\n\n    accuracy                           0.60       120\n   macro avg       0.30      0.50      0.37       120\nweighted avg       0.36      0.60      0.45       120\n'

In [45]:
from sklearn.metrics import confusion_matrix

In [46]:
confusion_matrix(y_test,predictions)

array([[72,  0],
       [48,  0]])

In [49]:
from sklearn.metrics import accuracy_score

In [50]:
 accuracy_score(y_test,predictions)

0.6